tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "stacklok/tap"
# Build OCI images from APK packages directly without Dockerfile
brew "apko"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Asynchronous DNS library
brew "c-ares"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Core application library for C
brew "glib"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# Console Matrix
brew "cmatrix"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# HTTP/2 C Library
brew "libnghttp2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff for Docker and OCI container images
brew "diffoci"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line tool for DigitalOcean
brew "doctl"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Library and utilities for processing GIFs
brew "giflib"
# Distributed revision control system
brew "git"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Common error values for all GnuPG components
brew "libgpg-error"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Vulnerability scanner for container images and filesystems
brew "grype"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Ping-like tool for HTTP requests
brew "httping"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# General purpose TCP-IP emulator
brew "libslirp"
# Mac App Store command-line interface
brew "mas"
# Build APKs from source code
brew "melange"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Text-based UI library
brew "ncurses"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Tool to build, change, and version infrastructure
brew "terraform"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# frizbee is a tool you may throw a tag at and it comes back with a checksum.
brew "stacklok/tap/frizbee"
# Password manager that keeps all passwords secure behind one password
cask "1password", args: { appdir: "/Applications" }
# Application launcher and productivity software
cask "alfred"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Tools for building Android applications
cask "android-studio"
# Two-factor authentication software
cask "authy"
# Web browser focusing on privacy
cask "brave-browser"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# App to build and share containerised applications and microservices
cask "docker"
# Find files, folders, or contents in any file
cask "easyfind"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Download manager with a torrent client
cask "folx"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open-source video transcoder
cask "handbrake"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Disposable email client
cask "tempbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Image viewer and file browser
cask "xee"
# Video communication and virtual meeting platform
cask "zoom", args: { appdir: "~/Applications" }
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Apple Configurator", id: 1037126344
mas "Battery Health 2", id: 1120214373
mas "Cardhop", id: 1290358394
mas "Compressor", id: 424390742
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Disk Doctor", id: 455970963
mas "Disk Map", id: 715464874
mas "Duplicate Detective", id: 686428787
mas "Final Cut Pro", id: 424389933
mas "HP Smart", id: 1474276998
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDF Protector", id: 566631581
mas "PDF Squeezer", id: 1502111349
mas "PDF Text Include", id: 6443781970
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
mas "VN", id: 1494451650
mas "Wondershare Filmora 13", id: 1516822341
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "googlecloudtools.cloudcode"
vscode "gruntfuggly.todo-tree"
vscode "helixquar.randomeverything"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "wix.vscode-import-cost"
