tap "encoredev/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jandedobbeleer/oh-my-posh"
tap "nats-io/nats-tools"
tap "stacklok/tap"
# Build OCI images from APK packages directly without Dockerfile
brew "apko"
# Portable library for network traffic capture
brew "libpcap"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Asynchronous DNS library
brew "c-ares"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core utilities for Python packages
brew "python-packaging"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# Low-level library for pixel manipulation
brew "pixman"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Vector graphics library with cross-device output support
brew "cairo"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# HTTP/2 C Library
brew "libnghttp2"
# Extremely Fast Compression algorithm
brew "lz4"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff for Docker and OCI container images
brew "diffoci"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Library and utilities for processing GIFs
brew "giflib"
# Distributed revision control system
brew "git"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Common error values for all GnuPG components
brew "libgpg-error"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Vulnerability scanner for container images and filesystems
brew "grype"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Ping-like tool for HTTP requests
brew "httping"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# General purpose TCP-IP emulator
brew "libslirp"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Mac App Store command-line interface
brew "mas"
# Build APKs from source code
brew "melange"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Text-based UI library
brew "ncurses"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Secrets management tool for developers
brew "teller"
# Tool to build, change, and version infrastructure
brew "terraform"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
# HCP CLI
brew "hashicorp/tap/hcp"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
# NATS utility
brew "nats-io/nats-tools/nats"
# frizbee is a tool you may throw a tag at and it comes back with a checksum.
brew "stacklok/tap/frizbee"
# Password manager that keeps all passwords secure behind one password
cask "1password", args: { appdir: "/Applications" }
# Application launcher and productivity software
cask "alfred"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Tools for building Android applications
cask "android-studio"
# Two-factor authentication software
cask "authy"
# Web browser focusing on privacy
cask "brave-browser"
# Design tool
cask "canva"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Find files, folders, or contents in any file
cask "easyfind"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Download manager with a torrent client
cask "folx"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collection of apps available by subscription
cask "setapp"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Mux and tag mp4 files
cask "subler"
# Text editor for code, markup and prose
cask "sublime-text"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Disposable email client
cask "tempbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Image viewer and file browser
cask "xee"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom", args: { appdir: "~/Applications" }
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Apple Configurator", id: 1037126344
mas "Battery Health 2", id: 1120214373
mas "Cardhop", id: 1290358394
mas "Compressor", id: 424390742
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Disk Doctor", id: 455970963
mas "Disk Map", id: 715464874
mas "Duplicate Detective", id: 686428787
mas "Final Cut Pro", id: 424389933
mas "HP Smart", id: 1474276998
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDF Protector", id: 566631581
mas "PDF Squeezer", id: 1502111349
mas "PDF Text Include", id: 6443781970
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
mas "VN", id: 1494451650
mas "Xcode", id: 497799835
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "localizely.flutter-intl"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rvest.vs-code-prettier-eslint"
vscode "skellock.just"
